SparkEVO/SparkEVO-ArduinoCore-tinyAVR/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
sparkevo_rpmdot.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
sparkevo_rpmdot.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
sparkevo_rpmdot.bootloader.OSCCFG=0x01
sparkevo_rpmdot.bootloader.TCD0CFG_avrdude=
sparkevo_rpmdot.bootloader.TCD0CFG_serialupdi=
sparkevo_rpmdot.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
sparkevo_rpmdot.bootloader.APPEND=0x00
sparkevo_rpmdot.bootloader.BOOTEND=0x00
sparkevo_rpmdot.bootloader.resetpinbits=01
sparkevo_rpmdot.bootloader.avrdudestring=
sparkevo_rpmdot.bootloader.serialupdistring=-aerase
sparkevo_rpmdot.bootloader.tool=avrdude
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
sparkevo_rpmdot.build.bootload=
sparkevo_rpmdot.build.printfabr=
sparkevo_rpmdot.build.attachabr=
sparkevo_rpmdot.build.wireabr=
sparkevo_rpmdot.build.pwmabr=6
#sparkevo_rpmdot.build.optabr=.Os

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
sparkevo_rpmdot.upload.tool=avrdude
sparkevo_rpmdot.upload.workaround=
sparkevo_rpmdot.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
sparkevo_rpmdot.menu.chip.814=ATtiny814
sparkevo_rpmdot.menu.chip.814.build.board=AVR_ATtiny814
sparkevo_rpmdot.menu.chip.814.build.attiny=814
sparkevo_rpmdot.menu.chip.814.upload.maximum_size=8192
sparkevo_rpmdot.menu.chip.814.build.mrelax=
sparkevo_rpmdot.menu.chip.814.upload.maximum_data_size=512
sparkevo_rpmdot.menu.chip.814.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
sparkevo_rpmdot.menu.chip.814.bootloader.TCD0CFG_serialupdi=4:0x00

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
sparkevo_rpmdot.menu.clock.1internal=1 MHz internal
sparkevo_rpmdot.menu.clock.1internal.build.speed=1
sparkevo_rpmdot.menu.clock.1internal.build.clocksource=0

#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
sparkevo_rpmdot.menu.bodvoltage.1v8=1.8V (5 MHz or less)
sparkevo_rpmdot.menu.bodvoltage.1v8.bootloader.bodlevbits=000

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
sparkevo_rpmdot.menu.bodmode.enabled=Enabled/Enabled
sparkevo_rpmdot.menu.bodmode.enabled.bootloader.bodmodebits=00101

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
sparkevo_rpmdot.menu.eesave.enable=EEPROM retained
sparkevo_rpmdot.menu.eesave.enable.bootloader.eesavebit=1

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
sparkevo_rpmdot.menu.millis.enabled=Enabled (default timer)

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#sparkevo_rpmdot.menu.resetpin.UPDI=UPDI (no reset pin)
#sparkevo_rpmdot.menu.resetpin.UPDI.bootloader.resetpinbits=01
#sparkevo_rpmdot.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#sparkevo_rpmdot.menu.resetpin.reset.bootloader.resetpinbits=10
#sparkevo_rpmdot.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#sparkevo_rpmdot.menu.resetpin.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
sparkevo_rpmdot.menu.startuptime.0=0ms
sparkevo_rpmdot.menu.startuptime.0.bootloader.SYSCFG1=0x00

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
sparkevo_rpmdot.menu.wiremode.mors=Master or Slave (saves flash and RAM)
sparkevo_rpmdot.menu.wiremode.mors.build.wire=MORS

#----------------------------------------#
# printf() version options               #
#________________________________________#
sparkevo_rpmdot.menu.printf.default=Default (doesn't print floats, 1.4k flash use)

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
sparkevo_rpmdot.menu.PWMmux.default=PB0-2, PA3-5 (default)
sparkevo_rpmdot.menu.PWMmux.default.build.pwmabr=6

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
sparkevo_rpmdot.menu.attach.allenabled=On all pins, with new implementation.
sparkevo_rpmdot.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
sparkevo_rpmdot.menu.WDTtimeout.disabled=Disabled (recommended)
sparkevo_rpmdot.menu.WDTwindow.disabled=No delay before window "opens"
sparkevo_rpmdot.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
sparkevo_rpmdot.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000

##########################################################################
#  Non-bootloader                                                        #
#                                ##    ###      ####   ###  #   #      ###
#  ATtiny3226/3216              #  #  #   #     #   #   #   ##  #    #####
#  ATtiny1626/1616/1606           #   #   # === ####    #   # # #  #######
#  ATtiny826/816/806             #    #   #     #       #   #  ##    #####
#  ATtiny427/416/406            ####   ###      #      ###  #   #      ###
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
sparkevo_itronix_sensorbox.build.text_section_start=.text=0x0
sparkevo_itronix_sensorbox.build.millistimer=D0
sparkevo_itronix_sensorbox.build.board=AVR_ATtinyxy6
sparkevo_itronix_sensorbox.build.clocksource=0
sparkevo_itronix_sensorbox.build.core=megatinycore
sparkevo_itronix_sensorbox.build.mrelax= -mrelax
sparkevo_itronix_sensorbox.build.variant=txy6
#sparkevo_itronix_sensorbox.build.optimizationlevel=-Os
sparkevo_itronix_sensorbox.build.gcse=
sparkevo_itronix_sensorbox.build.tuned=
sparkevo_itronix_sensorbox.build.printf=
sparkevo_itronix_sensorbox.build.wire=MORS
sparkevo_itronix_sensorbox.build.attachmode=-DCORE_ATTACH_ALL
sparkevo_itronix_sensorbox.build.mcu=attiny{build.attiny}
sparkevo_itronix_sensorbox.build.f_cpu={build.speed}000000L
sparkevo_itronix_sensorbox.build.extra_flags=-DARDUINO_attinyxy6 {build.tuned}
sparkevo_itronix_sensorbox.build.export_merged_output=false
sparkevo_itronix_sensorbox.build.pwmflags=-DUSE_TIMERD0_PWM

